#include <Novice.h>

#include "SphericalCamera.h"

const char kWindowTitle[] = "LE2C_06_オオタニ_タクヤ";

// ========================================
// Windowsアプリケーションのエントリーポイント
// ========================================
int WINAPI WinMain(
	_In_ HINSTANCE,
	_In_opt_ HINSTANCE,
	_In_ LPSTR,
	_In_ int
) {

	// ========================================
	// Novice初期化
	// ========================================
	Novice::Initialize(
		kWindowTitle,
		1280,
		720
	);

	// ========================================
	// キー入力
	// ========================================
	char keys[256] = {};
	char preKeys[256] = {};

	// ========================================
	// 球面座標カメラ
	// ========================================
	SphericalCamera sphericalCamera;
	sphericalCamera.Initialize();

	// ========================================
	// メインループ
	// ========================================
	while (Novice::ProcessMessage() == 0) {

		// フレーム開始
		Novice::BeginFrame();

		// ----------------------------------------
		// キー入力更新
		// ----------------------------------------
		memcpy(preKeys, keys, 256);
		Novice::GetHitKeyStateAll(keys);

		// ========================================
		// 更新処理
		// ========================================
		sphericalCamera.Update();

		// ========================================
		// 描画処理
		// ========================================
		sphericalCamera.DrawImGui();

		// フレーム終了
		Novice::EndFrame();

		// ========================================
		// ESCで終了
		// ========================================
		if (
			preKeys[DIK_ESCAPE] == 0 &&
			keys[DIK_ESCAPE] != 0
			) {
			break;
		}
	}

	// ========================================
	// Novice終了
	// ========================================
	Novice::Finalize();

	return 0;
}